# Dockerfile

# Используем самую последнюю доступную и конкретную версию базового образа.
# В будущем мы будем обновлять именно эту строку (например, на 3.11.10).
FROM python:3.11.9-slim-bookworm

# Обновляем системные пакеты внутри образа до самых последних версий,
# которые доступны в репозиториях НА МОМЕНТ СБОРКИ.
# Это закрывает большинство известных уязвимостей.
RUN apt-get update && apt-get upgrade -y --no-install-recommends && \
    rm -rf /var/lib/apt/lists/*

# Устанавливаем рабочую директорию.
WORKDIR /app

# Копируем и устанавливаем зависимости Python.
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы нашего проекта.
COPY . .

# Сообщаем Docker о используемом порте.
EXPOSE 5000

# Команда по умолчанию для запуска бота.
CMD ["python", "-m", "app"]
